//
// This file contains an 'Intel Peripheral Driver' and is      
// licensed for Intel CPUs and chipsets under the terms of your
// license agreement with Intel or your vendor.  This file may 
// be modified by the user, subject to additional terms of the 
// license agreement                                           
//
// *++
//
// Copyright (c) 1999 - 2016 Intel Corporation. All rights reserved
// This software and associated documentation (if any) is furnished
// under a license and may only be used or copied in accordance
// with the terms of the license. Except as permitted by such
// license, no part of this software or documentation may be
// reproduced, stored in a retrieval system, or transmitted in any
// form or by any means without the express written consent of
// Intel Corporation.
//

//---------------------------------------------------------------------------
// SATA CONFIGURATION
//---------------------------------------------------------------------------
#string STR_SATA_TITLE            #language en-US "SATA Configuration"

#string STR_SATA2_SUBTITLE       #language en-US "SATA 2 controller"
#string STR_SATA3_SUBTITLE       #language en-US "SATA 3 controller"

//ENABLING
#string STR_SATA_CONTROLLER_0_EN    #language en-US "Sata controller 0"
#string STR_SATA_CONTROLLER_1_EN    #language en-US "Sata controller 1"
#string STR_SATA_EN_0_PROMPT       #language en-US "Sata port 0"
#string STR_SATA_EN_1_PROMPT       #language en-US "Sata port 1"
#string STR_SATA_EN_2_PROMPT       #language en-US "Sata port 2"
#string STR_SATA_EN_3_PROMPT       #language en-US "Sata port 3"



#string STR_SATA_MODE_IDE_PROMPT    #language en-US "IDE Mode"
#string STR_SATA_MODE_IDE_LEGACY_OPTION    #language en-US "Legacy"
#string STR_SATA_MODE_IDE_NATIVE_OPTION    #language en-US "Native"


#string STR_SATA_PORT_SIR_OVERWRITE_EN    #language en-US "Overwrite SIR values"
#string STR_SATA_PORT_SIR_LBC01           #language en-US " Hex value of LBC01"
#string STR_SATA_PORT_SIR_LBC23           #language en-US " Hex value of LBC23"
#string STR_SATA_PORT_SIR_LBC45           #language en-US " Hex value of LBC45"


//-----

//ENABLING SATA 3
#string STR_SATA3_CONTROLLER_EN    #language en-US "Sata 3 controller"
#string STR_SATA3_EN_0_PROMPT       #language en-US "Sata 3 port 0"
#string STR_SATA3_EN_1_PROMPT       #language en-US "Sata 3 port 1"
#string STR_SATA3_EN_2_PROMPT       #language en-US "Sata 3 port 2"
#string STR_SATA3_EN_3_PROMPT       #language en-US "Sata 3 port 3"

#string STR_SATA3_MODE_PROMPT    #language en-US "Sata 3 mode"



#string STR_SATA_CONTROLLER_PORT0_PROMPT     #language en-US "Port 0"
#string STR_SATA_CONTROLLER_PORT1_PROMPT     #language en-US "Port 1"
#string STR_SATA_CONTROLLER_PORT2_PROMPT     #language en-US "Port 2"
#string STR_SATA_CONTROLLER_PORT3_PROMPT     #language en-US "Port 3"


#string STR_SATA_CONTROLLER_MECHSW_PROMPT     #language en-US "Mechanical Switch"

#string STR_SATA_TYPE0                                                #language en-US "SATA Device Type"
#string STR_SATA_TYPE_HELP                                       #language en-US "Identify the SATA port is connected to Solid State Drive or Hard Disk Drive"
#string STR_SATA_HDD_STRING                                     #language en-US "Hard Disk Drive"
#string STR_SATA_SSD_STRING                                     #language en-US "Solid State Drive"

#string STR_SATA_EN_HELP          #language en-US "Enables/Disables sata device if supported by current cpu SKU."
#string STR_SATA_CONTROLLER_EN_HELP          #language en-US "Enables/Disables sata controller if supported by current cpu SKU."


#string STR_SATA_LPM_EN          #language en-US "LPM"
#string STR_SATA_LPM_EN_HELP     #language en-US "Enables/Disables Link Power Management"



///////////////
#string STR_SATA0_TITLE     #language en-US "SATA 0"
#string STR_SATA1_TITLE     #language en-US "SATA 1"
#string STR_SATA_TITLE_HELP    #language en-US "Configuration of SATA Controller" 

#string STR_SATA_CONTROLLER_EN    #language en-US "Enable controller"
#string STR_SATA_EN_HELP          #language en-US "Enables/Disables SATA Controller if supported by current cpu SKU."

#string STR_SATA_MODE_PROMPT         #language en-US "SATA Controller mode"
#string STR_SATA_MODE_AHCI_OPTION    #language en-US "AHCI"
#string STR_SATA_MODE_RAID_OPTION    #language en-US "RAID"
#string STR_SATA_MODE_SELECTION_PROMPT          #language en-US "SATA Mode Selection"
#string STR_SATA_MODE_SELECTION_HELP            #language en-US "Determines how SATA controller(s) operate."
#string STR_SATA_AHCI                           #language en-US "AHCI"
#string STR_SATA_RAID                           #language en-US "RAID"

#string STR_SATA_PORT0_CONFIGURATION    #language en-US "Port 0"
#string STR_SATA_PORT1_CONFIGURATION    #language en-US "Port 1"
#string STR_SATA_PORT2_CONFIGURATION    #language en-US "Port 2"
#string STR_SATA_PORT3_CONFIGURATION    #language en-US "Port 3"
#string STR_SATA_PORT4_CONFIGURATION    #language en-US "Port 4"
#string STR_SATA_PORT5_CONFIGURATION    #language en-US "Port 5"
#string STR_SATA_PORT6_CONFIGURATION    #language en-US "Port 6"
#string STR_SATA_PORT7_CONFIGURATION    #language en-US "Port 7"
#string STR_SATA_PORTX_HELP             #language en-US "Configuration of sata controller port"

// Denverton AptioV Override Start - EIP#291342
#string STR_SATA_DEVICE_INFO            #language en-US "Device Information:"
#string STR_SATA_DEVICE_SIZE            #language en-US "Device Size:"

#string STR_SATA0_PORT0_STRING            #language en-US "SATA 0 Port 0"
#string STR_SATA0_PORT0_NAME            #language en-US "[Not Installed]"
#string STR_SATA0_PORT0_SIZE            #language en-US "[Unknown]"

#string STR_SATA0_PORT1_STRING          #language en-US "SATA 0 Port 1"
#string STR_SATA0_PORT1_NAME            #language en-US "[Not Installed]"
#string STR_SATA0_PORT1_SIZE            #language en-US "[Unknown]"

#string STR_SATA0_PORT2_STRING          #language en-US "SATA 0 Port 2"
#string STR_SATA0_PORT2_NAME            #language en-US "[Not Installed]"
#string STR_SATA0_PORT2_SIZE            #language en-US "[Unknown]"

#string STR_SATA0_PORT3_STRING          #language en-US "SATA 0 Port 3"
#string STR_SATA0_PORT3_NAME            #language en-US "[Not Installed]"
#string STR_SATA0_PORT3_SIZE            #language en-US "[Unknown]"

#string STR_SATA0_PORT4_STRING          #language en-US "SATA 0 Port 4"
#string STR_SATA0_PORT4_NAME            #language en-US "[Not Installed]"
#string STR_SATA0_PORT4_SIZE            #language en-US "[Unknown]"

#string STR_SATA0_PORT5_STRING          #language en-US "SATA 0 Port 5"
#string STR_SATA0_PORT5_NAME            #language en-US "[Not Installed]"
#string STR_SATA0_PORT5_SIZE            #language en-US "[Unknown]"

#string STR_SATA0_PORT6_STRING          #language en-US "SATA 0 Port 6"
#string STR_SATA0_PORT6_NAME            #language en-US "[Not Installed]"
#string STR_SATA0_PORT6_SIZE            #language en-US "[Unknown]"

#string STR_SATA0_PORT7_STRING          #language en-US "SATA 0 Port 7"
#string STR_SATA0_PORT7_NAME            #language en-US "[Not Installed]"
#string STR_SATA0_PORT7_SIZE            #language en-US "[Unknown]"

#string STR_SATA1_PORT0_STRING          #language en-US "SATA 1 Port 0"
#string STR_SATA1_PORT0_NAME            #language en-US "[Not Installed]"
#string STR_SATA1_PORT0_SIZE            #language en-US "[Unknown]"

#string STR_SATA1_PORT1_STRING          #language en-US "SATA 1 Port 1"
#string STR_SATA1_PORT1_NAME            #language en-US "[Not Installed]"
#string STR_SATA1_PORT1_SIZE            #language en-US "[Unknown]"

#string STR_SATA1_PORT2_STRING          #language en-US "SATA 1 Port 2"
#string STR_SATA1_PORT2_NAME            #language en-US "[Not Installed]"
#string STR_SATA1_PORT2_SIZE            #language en-US "[Unknown]"

#string STR_SATA1_PORT3_STRING          #language en-US "SATA 1 Port 3"
#string STR_SATA1_PORT3_NAME            #language en-US "[Not Installed]"
#string STR_SATA1_PORT3_SIZE            #language en-US "[Unknown]"

#string STR_SATA1_PORT4_STRING          #language en-US "SATA 1 Port 4"
#string STR_SATA1_PORT4_NAME            #language en-US "[Not Installed]"
#string STR_SATA1_PORT4_SIZE            #language en-US "[Unknown]"

#string STR_SATA1_PORT5_STRING          #language en-US "SATA 1 Port 5"
#string STR_SATA1_PORT5_NAME            #language en-US "[Not Installed]"
#string STR_SATA1_PORT5_SIZE            #language en-US "[Unknown]"

#string STR_SATA1_PORT6_STRING          #language en-US "SATA 1 Port 6"
#string STR_SATA1_PORT6_NAME            #language en-US "[Not Installed]"
#string STR_SATA1_PORT6_SIZE            #language en-US "[Unknown]"

#string STR_SATA1_PORT7_STRING          #language en-US "SATA 1 Port 7"
#string STR_SATA1_PORT7_NAME            #language en-US "[Not Installed]"
#string STR_SATA1_PORT7_SIZE            #language en-US "[Unknown]"
// Denverton AptioV Override End - EIP#291342

#string STR_SATA_PORT_EN               #language en-US "Enable/disable port"
#string STR_SATA_PORT_EN_HELP          #language en-US "Enables/Disables SATA Controller port if supported by current cpu SKU."

#string STR_SATA_CONTROLLER_HOTPLUG_PROMPT     #language en-US "Hot plug"
#string STR_SATA_CONTROLLER_SPINUP_PROMPT     #language en-US "Spin up"

#string STR_SATA_TEST_MODE_PROMPT        #language en-US "SATA Testmode"
#string STR_SATA_TEST_MODE_HELP          #language en-US "Enable/Disable Sata test mode"

#string STR_SATA_CONTROLLER_SPEED_PROMPT    #language en-US "Speed limit"
#string STR_SATA_CONTROLLER_SPEED_HELP      #language en-US "Indicates the highest allowable speed of the interface"
#string STR_SATA_CONTROLLER_GEN1_PROMPT     #language en-US "Gen 1"
#string STR_SATA_CONTROLLER_GEN2_PROMPT     #language en-US "Gen 2"
#string STR_SATA_CONTROLLER_GEN3_PROMPT     #language en-US "Gen 3"

#string STR_SATA_LPM_EN          #language en-US "LPM"
#string STR_SATA_LPM_EN_HELP     #language en-US "Enables/Disables Link Power Management"
#string STR_SATA_SALP_EN         #language en-US "    ALPM"
#string STR_SATA_SALP_EN_HELP    #language en-US "Enables/Disables Agresive Link Power Management"

#string STR_SATA_AIE_EN          #language en-US "Alternate ID Enable"
#string STR_SATA_AIE_EN_HELP    #language en-US "When disabled, HW will report the pre-determined device ID."

#string STR_SATA_PORT_MULTIPLIER_EN          #language en-US "Port Multiplier Support"
#string STR_SATA_PORT_MULTIPLIER_EN_HELP    #language en-US "Enables port multiplier support in CAP register of the controller."

#string STR_SATA_DEVICE_TYPE              #language en-US "Sata device type."
#string STR_SATA_DEVICE_TYPE_HELP         #language en-US "Sets the type of SATA device connected."
#string STR_SATA_DEVICE_TYPE_SSD          #language en-US "SSD"
#string STR_SATA_DEVICE_TYPE_HD           #language en-US "HD"

#string STR_SATA_TOPOLOGY0                      #language en-US "  Topology"
#string STR_SATA_TOPOLOGY_HELP                  #language en-US "Identify the SATA Topology if it is Default or ISATA or Flex or DirectConnect or M2"
#string STR_SATA_UNKNOWN_TOPOLOGY_STRING        #language en-US "Unknown"
#string STR_SATA_ISATA_STRING                   #language en-US "ISATA"
#string STR_SATA_DIRECT_CONNECT_STRING          #language en-US "Direct Connect"
#string STR_SATA_FLEX_STRING                    #language en-US "Flex"
#string STR_SATA_M2_STRING                      #language en-US "M2"
